# Formulae

## Development Tools
brew "gh" # GitHub command-line tool
brew "git" # Distributed revision control system
brew "git-lfs" # Git extension for versioning large files
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "node" # Platform built on V8 to build network applications
brew "pkg-config" # Manage compile and link flags for libraries
brew "python" # Interpreted, interactive, object-oriented programming language
brew "stow" # Organize software neatly under a single directory tree (e.g. /usr/local)
brew "tree" # Display directories as trees (with optional color/HTML output)

## Utilities
brew "ffmpeg" # Play, record, convert, and stream audio and video
brew "mas" # Mac App Store command-line interface
brew "wget" # Internet file retriever
brew "webp" # New file format for still image compression
brew "yt-dlp" # Feature-rich command-line audio/video downloader

# Casks

## Development Tools
cask "firefox@developer-edition" # Web browser
cask "font-fira-code" # Free monospaced font with programming ligatures
cask "visual-studio-code" # Open-source code editor

## Utilities & Applications
cask "appcleaner" # Application uninstaller
cask "bartender" # Menu bar icon organiser
cask "discord" # Voice and text chat software
cask "iina" # Free and open-source media player
cask "maccy"  # Clipboard manager
cask "meetingbar" # Shows the next meeting in the menu bar
cask "onyx" # Verify system files structure, run miscellaneous maintenance and more
cask "raycast" # Control your tools with a few keystrokes
cask "rectangle" # Move and resize windows using keyboard shortcuts or snap areas
cask "replacicon" # App icon replacement utility
cask "spotify" # Music streaming service
cask "zoom" # Video communication and virtual meeting platform

# Mac App Store
mas "Bitwarden", id: 1_352_778_147
mas "Dato", id: 1_470_584_107
mas "Pure Paste", id: 1_611_378_436
mas "Things 3", id: 904_280_696

# VSCode Extensions

## Theming
vscode "equinusocio.vsc-material-theme-icons" # Material Theme Icons
vscode "miguelsolorio.fluent-icons" # Fluent product icons for VS Code
vscode "zhuangtongfa.material-theme" # Atom's iconic One Dark theme

## Language/Library Support
vscode "bierner.markdown-preview-github-styles" # Changes VS Code's built-in markdown preview to match Github's style
vscode "bradlc.vscode-tailwindcss" # Intelligent Tailwind CSS tooling for VS Code
vscode "dbaeumer.vscode-eslint" # Integrates ESLint JavaScript into VS Code.
vscode "editorconfig.editorconfig" # EditorConfig Support for VS Code
vscode "ericadamski.carbon-now-sh" # A Code package to open the current editor content in carbon.now.sh
vscode "dsznajder.es7-react-js-snippets" # Extensions for React, React-Native and Redux in JS/TS with ES7+ syntax
vscode "esbenp.prettier-vscode" # Code formatter using prettier
vscode "github.vscode-github-actions" # GitHub Actions workflows and runs for github.com hosted repositories
vscode "mikestead.dotenv" # Support for dotenv file syntax
vscode "ms-python.black-formatter" # Formatting support for Python files using the Black formatter.
vscode "ms-python.debugpy" # Python Debugger extension using debugpy
vscode "ms-python.python" # Python language support
vscode "ms-python.vscode-pylance" # A performant, feature-rich language server for Python in VS Code
vscode "ms-vscode.makefile-tools" # Provide makefile support in VS Code
vscode "ms-vscode.vscode-js-profile-flame" # Flame graph visualizer for Heap and CPU profiles taken from the JavaScript debugger
vscode "prisma.prisma" # Adds syntax highlighting, formatting, auto-completion, jump-to-definition and linting for .prisma files
vscode "tamasfe.even-better-toml" # Fully-featured TOML support

## Utilities
vscode "arcanis.vscode-zipfs" # Easily inspect and modify files stored within zip archives
vscode "christian-kohler.npm-intellisense" # Autocompletes npm modules in import statements
vscode "github.copilot" # Your AI pair programmer
vscode "github.copilot-chat" # AI chat features powered by Copilot
vscode "gitHub.remotehub" # Remotely browse and edit any GitHub repository
vscode "github.vscode-pull-request-github" # Pull Request and Issue Provider for GitHub
vscode "ms-vscode.azure-repos" # Remotely browse and edit any Azure Repos
vscode "ms-vscode.remote-repositories" # Remotely browse and edit git repositories
vscode "ms-vsliveshare.vsliveshare" # Real-time collaborative development from the comfort of your favorite tools
vscode "quicktype.quicktype"# Copy JSON, paste as Go, TypeScript, C#, C++ and more
vscode "stkb.rewrap" # Hard word wrapping for comments and other text at a given column
vscode "streetsidesoftware.code-spell-checker" # Spelling checker for source code
vscode "visualstudioexptteam.intellicode-api-usage-examples" # See relevant code examples from GitHub for over 100K different APIs right in your editor.
vscode "vscodevim.vim" # Vim emulation for VS Code
vscode "waderyan.gitblame" # See git blame information in the status bar
vscode "wayou.vscode-todo-highlight" # TODO Highlight
