# Taps
tap "hashicorp/tap", trusted: true
tap "nodenv/nodenv", trusted: true
tap "terraform-linters/tap", trusted: true

# Formulae

## Development Tools

brew "chezmoi" # Manage your dotfiles across multiple diverse machines, securely
brew "gh" # GitHub command-line tool
brew "git" # Distributed revision control system
brew "git-lfs" # Git extension for versioning large files
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "hashicorp/tap/terraform", trusted: true # Tool to build, change, and version infrastructure
brew "latexindent" # Add indentation to LaTeX files
brew "markdownlint-cli" # CLI for Node.js style checker and lint tool for Markdown files
brew "nodenv" # Manage multiple NodeJS versions
# Per https://github.com/nodenv/nodenv/issues/183, this seems like the best way to setup global packages
brew "nodenv/nodenv/nodenv-default-packages", trusted: true # Auto-installs packages for Node installs
brew "nodenv/nodenv/nodenv-nvmrc", trusted: true # Pick a node version from .nvmrc
brew "oci-cli" # Oracle Cloud Infrastructure CLI
brew "pinentry-mac" if OS.mac? # Pinentry for GPG on Mac
brew "pyenv" # Python version management
brew "shfmt" # Autoformat shell script source code
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "yamllint" # Linter for YAML files
brew "zsh-completions" # Additional completion definitions for zsh

## Utilities

brew "bitwarden-cli" # Secure and free password manager for all of your devices
brew "dezoomify-rs" # Tiled image downloader
brew "ffmpeg" # Play, record, convert, and stream audio and video
brew "exiftool" # Perl lib for reading and writing EXIF metadata
brew "internetarchive" # Python wrapper for the various Internet Archive APIs
brew "imagemagick" # Tools and libraries to manipulate images in many formats
brew "librsvg" # Library to render SVG files using Cairo
brew "mas" if OS.mac? # Mac App Store command-line interface
brew "netcat" # Utility for managing network connections
brew "ocrmypdf" # Adds an OCR text layer to scanned PDF files
brew "pdfgrep" # Search PDFs for strings matching a regular expression
brew "pngcrush" # Optimizer for PNG files
brew "poppler" # PDF rendering library (based on the xpdf-3.0 code base)
brew "rclone" # Rsync for cloud storage
brew "sevenzip" # 7-Zip is a file archiver with a high compression ratio
brew "wget" # Internet file retriever
brew "whisper-cpp" # Port of OpenAI's Whisper model in C/C++
brew "yq" # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yt-dlp" # Feature-rich command-line audio/video downloader

# Casks

# Since some casks (e.g. google-chrome) do not have a SHA-256 checksum because
# their download URLs are not versioned, --require-sha is manually set here
# instead of HOMEBREW_CASK_OPTS. See Homebrew/homebrew-cask#147305

## Development Tools

cask "basictex", args: { require_sha: true } # Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "firefox@developer-edition", args: { require_sha: true } # Web browser
cask "font-fira-code", args: { require_sha: true } # Free monospaced font with programming ligatures
cask "font-liberation", args: { require_sha: true } # The Liberation Fonts is font collection which aims to provide document layout compatibility
cask "ghostty", args: { require_sha: true } # Terminal emulator that uses platform-native UI and GPU acceleration
# https://github.com/Homebrew/homebrew-cask/blob/main/Casks/g/google-chrome.rb#L3
cask "google-chrome" # Web browser
cask "postman", args: { require_sha: true } # Collaboration platform for API development
cask "visual-studio-code", args: { require_sha: true } # Open-source code editor

## Utilities & Applications

cask "alfred", args: { require_sha: true } # Application launcher and productivity software
cask "altserver", args: { require_sha: true } # iOS App Store alternative
cask "appcleaner", args: { require_sha: true } # Application uninstaller
cask "bitwarden", args: { require_sha: true } # Desktop password and login vault
cask "discord", args: { require_sha: true } # Voice and text chat software
cask "docker-desktop", args: { require_sha: true } # App to build and share containerised applications and microservices
cask "iina", args: { require_sha: true } # Free and open-source media player
cask "inkscape", args: { require_sha: true } # Vector graphics editor
# https://github.com/Homebrew/homebrew-cask/blob/36dcd5e306210e65a0be1db131a8bf0313003b15/Casks/l/logi-options%2B.rb#L35
cask "logi-options+" # Software for Logitech devices
cask "naps2", args: { require_sha: true } # Document scanning application
cask "obsidian", args: { require_sha: true } # Knowledge base that works on top of a local folder of plain text Markdown files
# https://github.com/Homebrew/homebrew-cask/blob/main/Casks/o/onyx.rb#L2
cask "onyx" # Verify system files structure, run miscellaneous maintenance and more
cask "protonvpn", args: { require_sha: true } # VPN client focusing on security
# https://github.com/Homebrew/homebrew-cask/blob/main/Casks/s/spotify.rb#L5
cask "spotify" # Music streaming service
cask "terraform-linters/tap/tflint", trusted: true, args: { require_sha: true } # Pluggable Terraform linter
cask "thaw@beta", args: { require_sha: true } # Menu bar manager
cask "zoom", args: { require_sha: true } # Video communication and virtual meeting platform
cask "zotero", args: { require_sha: true } # Collect, organise, cite, and share research sources

# Mac App Store

mas "Brother iPrint&Scan", id: 1_193_539_993 # https://apps.apple.com/us/app/brother-iprint-scan/id1193539993
mas "Dato", id: 1_470_584_107 # https://apps.apple.com/us/app/dato/id1470584107
mas "Things 3", id: 904_280_696 # https://apps.apple.com/us/app/things-3/id904280696
mas "Wireguard", id: 1_451_685_025 # https://apps.apple.com/us/app/wireguard/id1451685025

# VSCode Extensions

## Theming

vscode "miguelsolorio.fluent-icons" # Fluent product icons for VS Code
vscode "pkief.material-icon-theme" # Material Design Icons for VS Code
vscode "zhuangtongfa.material-theme" # Atom's iconic One Dark theme

## Language/Library Support

vscode "astro-build.astro-vscode" # Language support for Astro
vscode "bierner.markdown-preview-github-styles" # Changes VS Code's built-in markdown preview to match Github's style
vscode "bradlc.vscode-tailwindcss" # Intelligent Tailwind CSS tooling for VS Code
vscode "burkeholland.simple-react-snippets" # Dead simple React snippets you will actually use
vscode "dbaeumer.vscode-eslint" # Integrates ESLint JavaScript into VS Code.
vscode "editorconfig.editorconfig" # EditorConfig Support for VS Code
vscode "esbenp.prettier-vscode" # Code formatter using prettier
vscode "foxundermoon.shell-format" # A formatter for shell scripts, Dockerfile, gitignore, dotenv, /etc/hosts, jvmoptions, and other file types
vscode "github.vscode-github-actions" # GitHub Actions workflows and runs for github.com hosted repositories
vscode "grafana.grafana-alloy" # Grafana Alloy support
vscode "hashicorp.terraform" # Syntax highlighting and autocompletion for Terraform
vscode "james-yu.latex-workshop" # Boost LaTeX typesetting efficiency with preview, compile, autocomplete, colorize, and more
vscode "mikestead.dotenv" # Support for dotenv file syntax
vscode "ms-azuretools.vscode-docker" # Makes it easy to create, manage, and debug containerized applications.
vscode "ms-python.black-formatter" # Formatting support for Python files using the Black formatter.
vscode "ms-python.debugpy" # Python Debugger extension using debugpy
vscode "ms-python.python" # Python language support
vscode "ms-python.vscode-pylance" # A performant, feature-rich language server for Python in VS Code
vscode "ms-python.vscode-python-envs" # Provides a unified python environment experience
vscode "ms-toolsai.jupyter" # Jupyter notebook support, interactive programming and computing that supports Intellisense, debugging and more.
vscode "ms-vscode.makefile-tools" # Provide makefile support in VS Code
vscode "ms-vscode-remote.remote-containers" # Open any folder or repository inside a Docker container and take advantage of Visual Studio Code's full feature set.
vscode "ms-vscode.vscode-js-profile-flame" # Flame graph visualizer for Heap and CPU profiles taken from the JavaScript debugger
vscode "orta.vscode-jest" # Use Facebook's Jest With Pleasure
vscode "oxc.oxc-vscode" # Oxlint and Oxfmt editor integration
vscode "prisma.prisma" # Adds syntax highlighting, formatting, auto-completion, jump-to-definition and linting for .prisma files
vscode "redis.redis-for-vscode" # Visually interact with data and build queries in Redis
vscode "tamasfe.even-better-toml" # Fully-featured TOML support
vscode "vitest.explorer" # A Vite-native testing framework. It's fast!

## Utilities

vscode "arcanis.vscode-zipfs" # Easily inspect and modify files stored within zip archives
vscode "gitHub.remotehub" # Remotely browse and edit any GitHub repository
vscode "github.vscode-pull-request-github" # Pull Request and Issue Provider for GitHub
vscode "ms-vscode.azure-repos" # Remotely browse and edit any Azure Repos
vscode "ms-vscode.remote-repositories" # Remotely browse and edit git repositories
vscode "ms-azuretools.vscode-containers" # Makes it easy to create, manage, and debug containerized applications
vscode "ms-vsliveshare.vsliveshare" # Real-time collaborative development from the comfort of your favorite tools
vscode "stkb.rewrap" # Hard word wrapping for comments and other text at a given column
vscode "vscodevim.vim" # Vim emulation for VS Code
vscode "waderyan.gitblame" # See git blame information in the status bar
vscode "wayou.vscode-todo-highlight" # TODO Highlight
